module

public import CFSG.LocalAnalysis.EvenSporadicStandard.HNRecog.TwoHSData.BlockCheck
public import CFSG.LocalAnalysis.EvenSporadicStandard.HNRecog.TwoHSData.ClassData

public section

namespace CFSG.EvenSporadicStandard.HNRecog

open CFSG.Sporadic.Th.Native

@[expose] def kSpec : List (List (ℕ × ℕ)) :=
  [[(1, 1)],
    [(2, 1), (1, 1), (2, 7)],
    [(2, 2)]]

@[expose] def blkStrK : String :=
  "044440424433514340004400000414143140003352144030500505434505113431411100400400" ++
  "411111444340050400053044305304430141333324034114134203054142410105300540000444" ++
  "211104141124440300200004541303543450530330442043030334420433013333345345404032" ++
  "434253225323323423552515241120240113034524045331444311111225115144101000131414" ++
  "355200004044311441333320343413454154133043454124513333533533223324430230021112" ++
  "125224303023241211333322242110150020211121530044540010101120022411122144131310" ++
  "443233222042401344345405335150303203352333313100004522031120220502151534222422" ++
  "323323205245005141121325222121212122110251121151522214104251411213205222322032" ++
  "322120323212422225022011452403322022422232311111015451145140211002323433322222" ++
  "225555555555555555555555555555555555555555555555555555555555555555555555555555" ++
  "555555555555555555555555555555555555555555555555555555555555555555555555555555" ++
  "555555555555555555555555555555555555555555555555555555555555555555555555555555" ++
  "555555555555555555555555555555555555555555555555555555555555555555555555555555" ++
  "555555555555555555555555555555555555555555555555555555555555555555555555555555" ++
  "555555555555555555555555555555555555555555555555555555555555555555555555555555" ++
  "555555555555555555555555555555555555555555555555555555555555555555555555555555" ++
  "555555555555555555555555555555555555555555555555555555555555555555555555555555" ++
  "555555555555555555555555555555555555555555555555555555555555555555555555555555" ++
  "5555"

@[expose] def labsK : List Table := [#[1, 0, 4, 2, 3], #[2, 3, 4, 1, 0], #[2, 1, 0, 4, 3]]

@[expose] def nSpecK : List (List (ℕ × ℕ)) :=
  [[(1, 2), (2, 2), (3, 3)],
    [(2, 5), (2, 1), (3, 2)],
    [(1, 4), (3, 1), (2, 4)],
    [(1, 1), (3, 3), (2, 4), (1, 3)],
    [(1, 1), (2, 2), (3, 3), (1, 1), (3, 2)],
    [(1, 1), (2, 5), (1, 5), (3, 3), (2, 3)]]

@[expose] def xSpecK : List (ℕ × ℕ) :=
  [(5, 1), (4, 1), (6, 1), (3, 1), (1, 1)]

@[expose] def ySpecK : List (ℕ × ℕ) :=
  [(2, 1)]

@[expose] def qSpecK : List (List (ℕ × ℕ)) :=
  [[(1, 1), (4, 1)],
    [(5, 1), (2, 1)],
    [(3, 1), (2, 1), (1, 1)],
    [(1, 1)]]

@[expose] def cSpecK : List (ℕ × ℕ) :=
  [(5, 1), (1, 1), (5, 1), (1, 1)]

@[expose] def eSpecK : List (List (ℕ × ℕ)) :=
  [[(4, 1), (2, 1), (1, 1), (4, 1), (3, 1)],
    [(5, 1), (2, 1)],
    [(5, 1), (1, 1), (5, 1), (1, 1)]]

@[expose] def kWords : List (List ℕ) := kSpec.map (specWord classz.centGens)

@[expose] def blkDataK : BlkData where
  k := 5
  blk := blkOfString blkStrK
  gens := kWords
  labs := labsK

@[expose] def nWordsK : List (List ℕ) := nSpecK.map (specWord kWords)

@[expose] def xWordK : List ℕ := specWord nWordsK xSpecK
@[expose] def yWordK : List ℕ := specWord nWordsK ySpecK

@[expose] def zcWordsK : List (List ℕ) := [xWordK, yWordK]

@[expose] def qWordsK : List (List ℕ) := qSpecK.map (specWord nWordsK)

@[expose] def cWordK : List ℕ := specWord nWordsK cSpecK

@[expose] def eWordsK : List (List ℕ) := eSpecK.map (specWord nWordsK)

end CFSG.EvenSporadicStandard.HNRecog
