module

public import Certificates.Data.Kernel.PermCent.U43P1

public section

namespace CFSG.ComponentClassification.HarrisLit.P1.U43.Quat

@[expose] def cC0 : ℕ := 734617117088562

@[expose] def cC0inv : ℕ := 628265569247850

@[expose] def cC2 : ℕ := 1235364700332304

@[expose] def cC2inv : ℕ := 1235360913198140

@[expose] def quatDets : List (ℕ × ℕ) :=
  [(734617117088562, 3), (628265569247850, 3), (1235364700332304, 3), (1235360913198140, 3)]

@[expose] def rootIdx : List ℕ :=
  [20, 22, 25, 26, 28, 29, 68, 75, 88, 95, 108, 113, 234, 251, 261, 268, 279, 282, 298, 315, 319,
    322, 333, 336, 342, 355, 357, 371, 381, 386, 630, 632, 636, 640, 643, 645, 647, 651, 654, 659,
    665, 673, 675, 682, 685, 691, 707, 714, 716, 722, 725, 769, 776, 778, 787, 788, 797, 801, 821,
    822, 845, 846, 852, 865, 869, 876, 1065, 1073, 1075, 1076, 1080, 1081, 1086, 1088, 1091, 1092,
    1100, 1101, 1106, 1114, 1117, 1123, 1125, 1131]

@[expose] def sK : List (ℕ × Bool) :=
  [(617683856814300, false), (335407163739562, false), (1388351657884191, false),
    (515004967056044, false), (436695468234247, true), (775458997221318, true),
    (1748666776004932, true), (1025476027401923, true)]

@[expose] def cfgIdx : List ℕ := [665, 1073, 20, 1101, 0, 288]

end CFSG.ComponentClassification.HarrisLit.P1.U43.Quat
